РП/src/Documents/РегистрацияПрочихДоходов/РегистрацияПрочихДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияПрочихДоходов</name>
  <registerRecords>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияУдержанияПоКонтрагентамАкционерам</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияУдержанияПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.СведенияОДоходахСтраховыеВзносы</registerRecords>
  <registerRecords>AccumulationRegister.СтраховыеВзносыПоФизическимЛицам</registerRecords>
  <registerRecords>AccumulationRegister.БухучетНачисленияУдержанияПоКонтрагентамАкционерам</registerRecords>
  <registerRecords>AccumulationRegister.ИсчисленныеСтраховыеВзносы</registerRecords>
  <registerRecords>AccumulationRegister.СведенияОДоходахНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплате</registerRecords>
  <registerRecords>AccumulationRegister.ИсчисленныйНДФЛ</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрочегоДохода</name>
    <type>
      <types>CatalogRef.ВидыПрочихДоходовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплатыВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаВыплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВыплачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьИсполнителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияУдержанияВзносы</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НДФЛ</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйПериод</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>DefinedType.ТерриторииВыполненияРаботВОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксРасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доход</name>
      <comment>ВидСтавки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтавки</name>
      <type>
        <types>EnumRef.ВидыСтавокНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>УвеличеннаяСтавка</name>
      <type>
        <types>EnumRef.ВидыСтавокНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодДохода</name>
      <type>
        <types>CatalogRef.ВидыДоходовНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>CatalogRef.ВидыЛьготПоНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЛьгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛьготы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходПолный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНалоговымНазначениямНДС</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

РП/src/Enums/РолиФизическихЛиц/РолиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиФизическихЛиц</name>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>БывшийСотрудник</name>
  </enumValues>
  <enumValues>
    <name>Акционер</name>
  </enumValues>
  <enumValues>
    <name>ПрочийПолучательДоходов</name>
  </enumValues>
  <enumValues>
    <name>РаздатчикЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Кандидат</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

РП/src/Documents/РегистрацияПрочихДоходов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ = Документы.РегистрацияПрочихДоходов.ПустаяСсылка() Тогда
		
		// создается новый документ
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный, Месяц", 
		"Объект.Организация", "Объект.Ответственный", "Объект.ПериодРегистрации");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		Если Не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
			Объект.ПериодРегистрации = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Объект.ПланируемаяДатаВыплаты = НачалоДня(ТекущаяДатаСеанса()) + 86400;
		ЗаполнитьДанныеФормыПоОрганизации();
		
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
	// Запомним дату документа, при смене месяца надо пересчитывать налоги и взносы.
	ДатаПрежняя = Объект.Дата;
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки".
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыРезультатыРасчетаНДФЛ" И Источник.ВладелецФормы = ЭтаФорма Тогда
		ОбновитьДанныеНДФЛНаСервере(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	КодДоходаНДФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.ВидПрочегоДохода, "КодДоходаНДФЛ");
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере();
	
	СохраняемыеЗначения = Новый Структура;
	СохраняемыеЗначения.Вставить("Исполнитель", ТекущийОбъект.Исполнитель);
	СохраняемыеЗначения.Вставить("ДолжностьИсполнителя", ТекущийОбъект.ДолжностьИсполнителя);
	
	ЗарплатаКадры.СохранитьЗначенияЗаполненияОтветственныхРаботников(ТекущийОбъект.Организация, СохраняемыеЗначения);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбработатьИзменениеОрганизацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбработатьИзменениеДатыДокументаНаСервере();
	ДатаПрежняя = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ВидПрочегоДоходаПриИзменении(Элемент)
	
	ОбработатьИзменениеВидаПрочегоДоходаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемаяДатаВыплатыПриИзменении(Элемент)
	
	РассчитатьНДФЛИВзносыВсем();
	
КонецПроцедуры


#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область ОбработчикиСобытийТаблицыФормыНачисленияУдержанияВзносы

&НаКлиенте
Процедура НачисленияФизическоеЛицоПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.НачисленияУдержанияВзносы.ТекущиеДанные;
	
	Если ДанныеСтроки.ФизическоеЛицо <> УдаляемоеФизическоеЛицо Тогда
		УдалитьДанныеУдаляемогоФизическогоЛица();
		УдаляемоеФизическоеЛицо = ДанныеСтроки.ФизическоеЛицо;
	КонецЕсли;
	
	
	РассчитатьНДФЛиВзносыПоТекущейСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияНачисленоПриИзменении(Элемент)
	
	РассчитатьНДФЛиВзносыПоТекущейСтроке();
	
КонецПроцедуры


&НаКлиенте
Процедура НачисленияУдержанияВзносыПередУдалением(Элемент, Отказ)
	
	Если Элементы.НачисленияУдержанияВзносы.ТекущиеДанные <> Неопределено Тогда
		УдаляемоеФизическоеЛицо = Элементы.НачисленияУдержанияВзносы.ТекущиеДанные.ФизическоеЛицо;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВзносыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.НачисленияУдержанияВзносы.ТекущиеДанные <> Неопределено Тогда
		
		Если НоваяСтрока И Копирование Тогда
			Элементы.НачисленияУдержанияВзносы.ТекущиеДанные.ФизическоеЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Иначе
			УдаляемоеФизическоеЛицо = Элементы.НачисленияУдержанияВзносы.ТекущиеДанные.ФизическоеЛицо;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВзносыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УдаляемоеФизическоеЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ДобавитьНовуюСтроку(ВыбранноеЗначение);
	Иначе
		Для Каждого ФизическоеЛицо Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтроку(ФизическоеЛицо);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияВзносыПослеУдаления(Элемент)
	
	УдалитьДанныеУдаляемогоФизическогоЛица();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура ПодборПолучателей(Команда)
	
	РолиФизическихЛиц = Новый Массив;
	РолиФизическихЛиц.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.Сотрудник"));
	РолиФизическихЛиц.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.БывшийСотрудник"));
	РолиФизическихЛиц.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.ПрочийПолучательДоходов"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("АдресСпискаПодобранныхФизическихЛиц", АдресСпискаПодобранныхФизическихЛиц());
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Роль", РолиФизическихЛиц);
	
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормы, Элементы.НачисленияУдержанияВзносы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОРасчетеНДФЛ(Команда)
	
	УчетНДФЛКлиентРасширенный.ОткрытьФормуПодробнееОРасчетеНДФЛ(
		Объект, "РегистрацияПрочихДоходов", ЭтаФорма, ОписаниеДокумента(ЭтаФорма), АдресСпискаПодобранныхФизическихЛиц());
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура УдалитьДанныеУдаляемогоФизическогоЛица()
	
	Если ЗначениеЗаполнено(УдаляемоеФизическоеЛицо) Тогда
		УчетНДФЛКлиентСерверРасширенный.УдалитьДанныеНДФЛФизическоголица(Объект, УдаляемоеФизическоеЛицо);
		УдаляемоеФизическоеЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьНачисленияСотрудника(Сотрудники, СохранятьИсправления = Истина) Экспорт
	РассчитатьНДФЛИВзносыНаСервере(Сотрудники);
КонецПроцедуры

&НаСервере
Процедура РассчитатьНДФЛИВзносыВсем()
	
	Если Не ЗначениеЗаполнено(Объект.ПланируемаяДатаВыплаты) Или Объект.НачисленияУдержанияВзносы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если РасчетНДФЛНарастающимИтогомСНачалаГода Тогда
		РассчитатьНДФЛИВзносыНаСервере();
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНДФЛиВзносыПоТекущейСтроке()
	
	ДанныеСтроки = Элементы.НачисленияУдержанияВзносы.ТекущиеДанные;
	
	Если ДанныеСтроки.ФизическоеЛицо.Пустая() Или ДанныеСтроки.Начислено = 0 Или Объект.ВидПрочегоДохода.Пустая() Или Не ЗначениеЗаполнено(Объект.ПланируемаяДатаВыплаты) Тогда
		
		Если ДанныеСтроки.Начислено = 0 Тогда
			ДанныеСтроки.НДФЛ = 0;
			ДанныеСтроки.КВыплате = 0;
		КонецЕсли;
		
	Иначе
		
		Если РасчетНДФЛНарастающимИтогомСНачалаГода Тогда
			РассчитатьНДФЛИВзносыНаСервере(ДанныеСтроки.ФизическоеЛицо);
		Иначе
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиКВыплате()
	
	Для Каждого ДанныеСтроки Из Объект.НачисленияУдержанияВзносы Цикл
		ЗаполнитьКВыплатеПоСтроке(ЭтаФорма, ДанныеСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКВыплатеПоСтроке(Форма, ДанныеСтроки)
	
	Если Форма.РасчетНДФЛНарастающимИтогомСНачалаГода Тогда
		
		ДанныеСтроки.НДФЛ = 0;
		СтрокиНДФЛ = Форма.Объект.НДФЛ.НайтиСтроки(Новый Структура("ФизическоеЛицо", ДанныеСтроки.ФизическоеЛицо));
		Для каждого СтрокаНДФЛ Из СтрокиНДФЛ Цикл
			ДанныеСтроки.НДФЛ = ДанныеСтроки.НДФЛ + СтрокаНДФЛ.Налог;
		КонецЦикла;
		
	КонецЕсли;
	ДанныеСтроки.КВыплате = ДанныеСтроки.Начислено - ДанныеСтроки.НДФЛ;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, НачалоДня(Объект.ПериодРегистрации));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеОрганизацииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	ЗаполнитьДанныеФормыПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДатыДокументаНаСервере()

	УстановитьФункциональныеОпцииФормы();
	Если НачалоМесяца(ДатаПрежняя) <> НачалоМесяца(Объект.Дата) Тогда
		РассчитатьНДФЛИВзносыВсем();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВидаПрочегоДоходаНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ВидПрочегоДохода) Тогда
		
		
	Иначе
		
		КодДоходаНДФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПрочегоДохода, "КодДоходаНДФЛ");
		
	КонецЕсли;
	
	УстановитьРежимРасчетаНДФЛИОтображениеЭлементовРедактированияНДФЛ();
	
	РассчитатьНДФЛИВзносыВсем();
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьИтогиНаСервере()

	Для каждого Строка Из ЭтотОбъект.Объект.НачисленияУдержанияВзносы Цикл
		ЗаполнитьКВыплатеПоСтроке(ЭтаФорма, Строка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхФизическихЛиц()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.НачисленияУдержанияВзносы.Выгрузить(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"), УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьНовуюСтроку(ФизическоеЛицо)
	
	СтрокиНачислений = Объект.НачисленияУдержанияВзносы.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	
	Если СтрокиНачислений.Количество() = 0 Тогда
		НоваяСтрока = Объект.НачисленияУдержанияВзносы.Добавить();
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоОрганизации()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли; 
	
	ЗапрашиваемыеЗначения = Новый Структура;
	ЗапрашиваемыеЗначения.Вставить("Организация", "Объект.Организация");
	
	ЗапрашиваемыеЗначения.Вставить("Исполнитель", "Объект.Исполнитель");
	ЗапрашиваемыеЗначения.Вставить("ДолжностьИсполнителя", "Объект.ДолжностьИсполнителя");
	
	ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ЭтаФорма, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));	
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	УстановитьРежимРасчетаНДФЛИОтображениеЭлементовРедактированияНДФЛ();
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДокумента(Форма)
	
	Описание = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеРасчетногоДокумента();
	Описание.МесяцНачисленияИмя		= "ПериодРегистрации";
	Описание.ПериодДействияВШапке	= Истина;
	Описание.НачалоБазовогоПериодаИмя = "";
	Описание.ОкончаниеБазовогоПериодаИмя = "";
	Описание.ИменаПолейНачисления	= "ВидПрочегоДохода";
	Описание.ВидНачисленияВШапке	= Истина;
	Описание.ВидНачисленияИмя		= "ВидПрочегоДохода";
	
	Описание.РассчитыватьУдержанияИмя = "РассчитыватьУдержания";
	
	Описание.НачисленияИмя			= "НачисленияУдержанияВзносы";
	Описание.НДФЛИмя				= "НДФЛ";
	
	Описание.РегистрацияНачисленийДоступна = Истина;
	
	Возврат Описание;
	
КонецФункции

&НаСервере
Функция СведенияОбНДФЛ() Экспорт
	
	ТаблицаНачислений = Объект.НачисленияУдержанияВзносы.Выгрузить();
	
	ТаблицаНачислений.Колонки.Добавить("Начисление", Новый ОписаниеТипов());
	ТаблицаНачислений.ЗаполнитьЗначения(Объект.ВидПрочегоДохода, "Начисление");
	
	Возврат УчетНДФЛФормыРасширенный.СведенияОбНДФЛ(ЭтаФорма, , , ТаблицаНачислений);
	
КонецФункции

&НаСервере
Процедура РассчитатьНДФЛИВзносыНаСервере(ФизическоеЛицо = Неопределено)
	
	Если ФизическоеЛицо = Неопределено Тогда
		СписокФизическихЛиц = Неопределено;
	Иначе
		СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РассчитатьНДФЛИВзносыДокумента(СписокФизическихЛиц);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	РассчитатьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимРасчетаНДФЛИОтображениеЭлементовРедактированияНДФЛ()
	
	РасчетНДФЛНарастающимИтогомСНачалаГода = УчетНДФЛФормыРасширенный.РасчетНДФЛНарастающимИтогомСНачалаГода(Объект.ВидПрочегоДохода);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодробнееОРасчетеНДФЛ",
		"Видимость",
		РасчетНДФЛНарастающимИтогомСНачалаГода);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НачисленияНДФЛ",
		"ТолькоПросмотр",
		РасчетНДФЛНарастающимИтогомСНачалаГода);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗаполнитьПоВыплатам",
		"Видимость",
		Объект.ВидПрочегоДохода.КодДоходаНДФЛ.Код = "157" ИЛИ Объект.ВидПрочегоДохода.КодДоходаНДФЛ.Код = "140");	
		
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеНДФЛНаСервере(АдресВременногоХранилища)
	
	Параметр = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Объект.НДФЛ.Загрузить(Параметр.НДФЛ.Выгрузить());
	
	
	Модифицированность = Истина;
	
	ЗаполнитьИтогиКВыплате();
	РассчитатьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЧПНаСервере()
	
	Объект.НачисленияУдержанияВзносы.Очистить(); 
	Объект.НДФЛ.Очистить();

	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ОстакиОбороты.Контрагент КАК Контрагент,
	               |	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	               |	СУММА(ОстакиОбороты.УдержНДФЛ) КАК УдержНДФЛ,
	               |	СУММА(ОстакиОбороты.УдержВС) КАК УдержВС,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОстакиОбороты.ОбДт > ОстакиОбороты.ОбКт
	               |				ТОГДА ОстакиОбороты.ОбДт - ОстакиОбороты.ОбКт
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК НачисленоДохода
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Хозрасчетный.Контрагент КАК Контрагент,
	               |		Хозрасчетный.Договор КАК Договор,
	               |		СУММА(Хозрасчетный.УдержНДФЛ) КАК УдержНДФЛ,
	               |		СУММА(Хозрасчетный.УдержВС) КАК УдержВС,
	               |		СУММА(Хозрасчетный.ОбКт) КАК ОбКт,
	               |		СУММА(Хозрасчетный.ОбДт) КАК ОбДт
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
	               |			ХозрасчетныйОбороты.Субконто2 КАК Договор,
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйОбороты.КорСчет В (&Счет6411)
	               |					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК УдержНДФЛ,
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйОбороты.КорСчет В (&Счет642)
	               |					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК УдержВС,
	               |			ХозрасчетныйОбороты.СуммаОборотДт КАК ОбДт,
	               |			ХозрасчетныйОбороты.СуммаОборотКт КАК ОбКт
	               |		ИЗ
	               |			РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
	               |		ГДЕ
	               |			ХозрасчетныйОбороты.Субконто1.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	               |			И (ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СписокКорСчетов)
	               |					ИЛИ ХозрасчетныйОбороты.КорСчет В (&Счет6411)
	               |					ИЛИ ХозрасчетныйОбороты.КорСчет В (&Счет642))) КАК Хозрасчетный
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Хозрасчетный.Контрагент,
	               |		Хозрасчетный.Договор) КАК ОстакиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО (ОстакиОбороты.Контрагент.КодПоЕДРПОУ <> """")
	               |			И ОстакиОбороты.Контрагент.КодПоЕДРПОУ = ФизическиеЛица.КодПоДРФО
	               |ГДЕ
	               |	(ОстакиОбороты.ОбДт > 0
	               |			ИЛИ ОстакиОбороты.ОбКт > 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстакиОбороты.Контрагент,
	               |	ФизическиеЛица.Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	                                
	Запрос.УстановитьПараметр("парамОрганизация", Объект.Организация);
	Если Объект.ПериодРегистрации < УчетНДФЛ.ДатаИзмененияСхемыУчетаВС() Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Объект.ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(Объект.ПериодРегистрации) );
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации) );
	КонецЕсли;	
	
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками);				//631
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУчастникамиПФГ);				//633
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторамиВНациональнойВалюте);	//6851
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте);	//3711
	
	СписокСчетовБанкКасса = Новый СписокЗначений;
	СписокСчетовБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.Касса);			//301
	СписокСчетовБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.СчетаВБанках);	//311
	СписокСчетовБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте);	//3721
	
	СписокСчетовАвансы = Новый СписокЗначений;
	СписокСчетовАвансы.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте);	//3711
	
	СписокСчетовПоставщики = Новый СписокЗначений;
	СписокСчетовПоставщики.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками);				//631
	СписокСчетовПоставщики.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУчастникамиПФГ);				//633
	СписокСчетовПоставщики.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторамиВНациональнойВалюте);	//6851
	
	Запрос.УстановитьПараметр("СписокСчетов"	, СписокСчетов);
	Запрос.УстановитьПараметр("Счет6411"		, ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ);
	Запрос.УстановитьПараметр("Счет642"			, ПланыСчетов.Хозрасчетный.РасчетыПоОбязательнымПлатежам);
	Запрос.УстановитьПараметр("СписокКорСчетов"	, СписокСчетовБанкКасса);
	Запрос.УстановитьПараметр("СписокСчетовАвансы"	, СписокСчетовАвансы);
    Запрос.УстановитьПараметр("СписокСчетовПоставщики"	, СписокСчетовПоставщики);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НачисленоДохода = 0 И Выборка.УдержНДФЛ = 0 И Выборка.УдержВС = 0 Тогда
			Продолжить;
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(Выборка.ФизическоеЛицо) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внимание! Для контрагента - %1 не найдено соответствия физического лица по коду ДФРО. Информация о нем не заполнена в документе!';uk='Увага! Для контрагента - %1 не знайдено відповідності фізичної особи за кодом ДФРО. Інформація про нього не заповнена в документі!'"), Выборка.Контрагент);
			Сообщить (ТекстСообщения);
			Продолжить;
			
		КонецЕсли;
		
		ТекСтрока = Объект.НачисленияУдержанияВзносы.Добавить();
			
		ТекСтрока.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		ТекСтрока.Начислено = Выборка.НачисленоДохода;
		ТекСтрока.НДФЛ = Выборка.УдержНДФЛ + Выборка.УдержВС;
		ТекСтрока.КВыплате = ТекСтрока.Начислено - ТекСтрока.НДФЛ;
		
		ТекСтрокаНДФЛ = Объект.НДФЛ.Добавить();
		ТекСтрокаНДФЛ.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		ТекСтрокаНДФЛ.Доход = Выборка.НачисленоДохода;
		ТекСтрокаНДФЛ.Налог = Выборка.УдержНДФЛ;
		ТекСтрокаНДФЛ.КодДохода = Объект.ВидПрочегоДохода.КодДоходаНДФЛ;
		ТекСтрокаНДФЛ.НалоговыйПериод = Объект.ПериодРегистрации;
		
		Если ЗначениеЗаполнено(Выборка.УдержВС) Тогда
			ТекСтрокаВС = Объект.НДФЛ.Добавить();
			ТекСтрокаВС.ФизическоеЛицо = Выборка.ФизическоеЛицо;
			ТекСтрокаВС.Доход = Выборка.НачисленоДохода;
			ТекСтрокаВС.Налог = Выборка.УдержВС;
			Если  Объект.ПериодРегистрации < УчетНДФЛ.ДатаИзмененияСхемыУчетаВС() Тогда
				ТекСтрокаВС.КодДохода = Объект.ВидПрочегоДохода.КодДоходаНДФЛ.ОблагаетсяВоеннымСбором;
			Иначе
				ТекСтрокаВС.КодДохода = Объект.ВидПрочегоДохода.КодДоходаНДФЛ.ОблагаетсяВоеннымСбором2021;
			КонецЕсли;	
			ТекСтрокаВС.НалоговыйПериод = Объект.ПериодРегистрации;
		КонецЕсли;	

	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАлиментыНаСервере()
	
	Объект.НачисленияУдержанияВзносы.Очистить(); 
	Объект.НДФЛ.Очистить();

	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
	               |	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК НачисленоДохода
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО (ХозрасчетныйОбороты.Субконто1.КодПоЕДРПОУ <> """")
	               |			И ХозрасчетныйОбороты.Субконто1.КодПоЕДРПОУ = ФизическиеЛица.КодПоДРФО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОбороты.Субконто1,
	               |	ФизическиеЛица.Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("парамОрганизация", Объект.Организация);
	Если Объект.ПериодРегистрации < УчетНДФЛ.ДатаИзмененияСхемыУчетаВС() Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Объект.ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(Объект.ПериодРегистрации) );
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации) );
	КонецЕсли;

	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументам);				//6853
	
	Запрос.УстановитьПараметр("СписокСчетов"	, СписокСчетов);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ФизическоеЛицо) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внимание! Для контрагента - %1 не найдено соответствия физического лица по коду ДФРО. Информация о нем не заполнена в документе!';uk='Увага! Для контрагента - %1 не знайдено відповідності фізичної особи за кодом ДФРО. Інформація про нього не заповнена в документі!'"), Выборка.Контрагент);
			Сообщить (ТекстСообщения);
			Продолжить;
			
		КонецЕсли;
		
		ТекСтрока = Объект.НачисленияУдержанияВзносы.Добавить();
			
		ТекСтрока.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		ТекСтрока.Начислено = Выборка.НачисленоДохода;
		ТекСтрока.НДФЛ = 0;
		ТекСтрока.КВыплате = ТекСтрока.Начислено;
		
		ТекСтрокаНДФЛ = Объект.НДФЛ.Добавить();
		ТекСтрокаНДФЛ.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		ТекСтрокаНДФЛ.Доход = Выборка.НачисленоДохода;
		ТекСтрокаНДФЛ.Налог = 0;
		ТекСтрокаНДФЛ.КодДохода = Объект.ВидПрочегоДохода.КодДоходаНДФЛ;
		ТекСтрокаНДФЛ.НалоговыйПериод = Объект.ПериодРегистрации;
		
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВыплатам(Команда)
	Если Элементы.КодДоходаНДФЛ.ТекстРедактирования = "157" Тогда
		ЗаполнитьЧПНаСервере();
	ИначеЕсли Элементы.КодДоходаНДФЛ.ТекстРедактирования = "140" Тогда
		ЗаполнитьАлиментыНаСервере();	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
